var dataCenter = {
	globalVariables: {
		'selectedBaseStation': null,
		'selectedDate': null,
		'selectedTime': null,//eg. "08:00:00 08:20:00"
		'BSNumArray':null, //数组，记录每一天的该基站的短信数量
		'seletedType': null,
		'BSidToPhone': null,
		"colorPannel":{
			//todo 可以用函数生成颜色,类型和regio最好用两套色系的颜色
			//regions
			"110101":"#CC9933",
		    "110102":"#993333",
		    "110103":"#99CCCC",
		    "110104":"#0066CC",
		    "110105":"#CC9966",
		    "110106":"#669966",
		    "110107":"#CC00FF",
		    "110108":"#CC6666",
		    "110109":"#CC3333",
		    "110111":"#CC99FF",
		    "110112":"#CCCC66",
		    "110113":"#66CC99",
		    "110114":"#CC0033",
		    "110115":"#CC6633",
		    "110116":"#669999",
		    "110117":"#663300",
		    "110228":"#CC00CC",
		    "110229":"#99CC66",

			// "types"
			"0":"#CC9933",
			"1":"#993333",
			"2":"#99CCCC",
			"3":"#0066CC",
			"4":"#CC9966",
			"5":"#669966",
			"6":"#CC00FF",
			"7":"#CC6666",
			"8":"#CC3333",
			"9":"#CC99FF",
			"10":"#CCCC66",
			"11":"#66CC99",
			"12":"#CC0033",
			"13":"#CC6633",
			"14":"#669999",
			"15":"#663300",
			"16":"#CC00CC",
			"17":"#99CC66",
		},
		"regionsMap":{
			"110101":"东城区",
			"110102":"西城区", 
			"110103":"崇文区", 
			"110104" :"宣武区", 
			"110105": "朝阳区" ,
			"110106": "丰台区" ,
			"110107": "石景山区", 
			"110108": "海淀区",
			"110109": "门头沟区", 
			"110111": "房山区" ,
			"110112": "通州区" ,
			"110113": "顺义区" ,
			"110114": "昌平区" ,
			"110115": "大兴区" ,
			"110116" :"怀柔区" ,
			"110117": "平谷区" ,
			"110228" :"密云县" ,
			"110229": "延庆县",
			"131028":"大厂回族自治县",
			"131082":"三河市",
		},
		"typesMap":{
		},
	},
	setGlobalVariable: function(variableName, value, setter){
		this.globalVariables[variableName] = value;
		observerManager.post('set:' + variableName, value, setter);
	}
}